resources/ts.wsdl.xhtml

<!--  Published by JAX-WS RI (http://jax-ws.java.net). RI's version is JAX-WS RI 2.2.9-b130926.1035 svn-revision#5f6196f2b90e9460065a4c2f4e30e065b245e51e.  -->
<!--  Generated by JAX-WS RI (http://jax-ws.java.net). RI's version is JAX-WS RI 2.2.9-b130926.1035 svn-revision#5f6196f2b90e9460065a4c2f4e30e065b245e51e.  -->
<definitions xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:wsp="http://www.w3.org/ns/ws-policy" xmlns:wsp1_2="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="http://ts.ch01/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="http://schemas.xmlsoap.org/wsdl/" targetNamespace="http://ts.ch01/" name="TimeServerImplService">
    <types/>
    <message name="getTimeAsElapsed"/>
    <message name="getTimeAsElapsedResponse">
        <part name="return" type="xsd:long"/>
    </message>
    <message name="getTimeAsString"/>
    <message name="getTimeAsStringResponse">
        <part name="return" type="xsd:string"/>
    </message>
    <portType name="TimeServer">
        <operation name="getTimeAsElapsed">
            <input wsam:Action="http://ts.ch01/TimeServer/getTimeAsElapsedRequest" message="tns:getTimeAsElapsed"/>
            <output wsam:Action="http://ts.ch01/TimeServer/getTimeAsElapsedResponse" message="tns:getTimeAsElapsedResponse"/>
        </operation>
        <operation name="getTimeAsString">
            <input wsam:Action="http://ts.ch01/TimeServer/getTimeAsStringRequest" message="tns:getTimeAsString"/>
            <output wsam:Action="http://ts.ch01/TimeServer/getTimeAsStringResponse" message="tns:getTimeAsStringResponse"/>
        </operation>
    </portType>
    <binding name="TimeServerImplPortBinding" type="tns:TimeServer">
        <soap:binding transport="http://schemas.xmlsoap.org/soap/http" style="rpc"/>
        <operation name="getTimeAsElapsed">
            <soap:operation soapAction=""/>
            <input>
                <soap:body use="literal" namespace="http://ts.ch01/"/>
            </input>
            <output>
                <soap:body use="literal" namespace="http://ts.ch01/"/>
            </output>
        </operation>
        <operation name="getTimeAsString">
            <soap:operation soapAction=""/>
            <input>
                <soap:body use="literal" namespace="http://ts.ch01/"/>
            </input>
            <output>
                <soap:body use="literal" namespace="http://ts.ch01/"/>
            </output>
        </operation>
    </binding>
    <service name="TimeServerImplService">
        <port name="TimeServerImplPort" binding="tns:TimeServerImplPortBinding">
            <soap:address location="http://localhost:9876/ts"/>
        </port>
    </service>
</definitions>